Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionBase Properties
The CurvedDimensionBase type exposes the following members.
Properties
Name | Description
ArcPoint1
 Gets the first arc point.
ArcPoint2
 Gets the second arc point.
ArcPoint3
 Gets the third arc point.
Attributes
 Gets or sets the curved dimension set base attributes.
Distance
 Gets the distance.
EndPoint
 The end point of the dimension.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from DimensionBase.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
StartPoint
 The start point of the dimension.
Top
See Also
Reference
CurvedDimensionBase Class
Tekla.Structures.Drawing Namespace